/* 0.4.0 */
/*===================================================================================================================================*/
/*  Copyright DENSO Corporation                                                                                                      */
/*===================================================================================================================================*/
/*  Alert 4wd                                                                                                                        */
/*===================================================================================================================================*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#define ALTAPP_4WD_C_MAJOR                  (0)
#define ALTAPP_4WD_C_MINOR                  (4)
#define ALTAPP_4WD_C_PATCH                  (0)

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Include Files                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#include "altapp_4wd_cfg.prm"

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Sw                                                                                                                      */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if((__ALTAPP_WRN_4WD_USE__ == 1) || (__ALTAPP_TT_DIFFLOCK_USE__ == 1) || (__ALTAPP_RMT_FWW_USE__ == 1))

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Version Check                                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#if ((ALTAPP_4WD_C_MAJOR != ALTAPP_4WD_H_MAJOR) || \
     (ALTAPP_4WD_C_MINOR != ALTAPP_4WD_H_MINOR) || \
     (ALTAPP_4WD_C_PATCH != ALTAPP_4WD_H_PATCH))
#error "source and header files are inconsistent!"
#endif

#if ((ALTAPP_4WD_C_MAJOR != ALTAPP_4WD_CFG_PRM_MAJOR) || \
     (ALTAPP_4WD_C_MINOR != ALTAPP_4WD_CFG_PRM_MINOR) || \
     (ALTAPP_4WD_C_PATCH != ALTAPP_4WD_CFG_PRM_PATCH))
#error "source and parameter files are inconsistent!"
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Type Definitions                                                                                                                 */
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Defines                                                                                                                          */
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Macros                                                                                                                           */
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Variable Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
static U1 u1_s_altapp_4wd_tt_out_4wd;
static U1 u1_s_altapp_4wd_tt_out_4wdlk;
static U1 u1_s_altapp_4wd_wrn_out;
static U1 u1_s_altapp_4wd_rmt_out;

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Constant Variable Definitions                                                                                                    */
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Static Function Prototypes                                                                                                       */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/* B_4WD */
static void vd_s_Altapp4wdJudgeB4wd(void);
#if(__ALTAPP_4WD_B_4WD_SUP__ == 1)
#if(__ALTAPP_TT_DIFFLOCK_USE__  == 1)
static U1 u1_s_Altapp4wdJudgeB4wdTt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var);
#else
#define u1_s_Altapp4wdJudgeB4wdTt(x,y,z) ((U1)ALTAPP_OUT_OFF)
#endif
#if(__ALTAPP_WRN_4WD_USE__  == 1)
static U1 u1_s_Altapp4wdJudgeB4wdWrn(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var);
#else
#define u1_s_Altapp4wdJudgeB4wdWrn(x,y,z) ((U1)ALTAPP_OUT_OFF)
#endif
#if(__ALTAPP_RMT_FWW_USE__  == 1)
static U1 u1_s_Altapp4wdJudgeB4wdRmt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var);
#else
#define u1_s_Altapp4wdJudgeB4wdRmt(x,y,z) ((U1)ALTAPP_OUT_OFF)
#endif
#endif

/* B_4WDLK */
static void vd_s_Altapp4wdJudgeB4wdlk(void);
#if(__ALTAPP_4WD_B_4WDLK_SUP__ == 1)
#if(__ALTAPP_TT_DIFFLOCK_USE__ == 1)
static U1 u1_s_Altapp4wdJudgeB4wdlkTt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var);
#else
#define u1_s_Altapp4wdJudgeB4wdlkTt(x,y,z) ((U1)ALTAPP_OUT_OFF)
#endif
#endif

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Definitions                                                                                                             */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*===================================================================================================================================*/
/*  Initialization                                                                                                                   */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_Altapp4wdInit(void)
{
    u1_s_altapp_4wd_tt_out_4wd = (U1)ALTAPP_OUT_OFF;
    u1_s_altapp_4wd_tt_out_4wdlk = (U1)ALTAPP_OUT_OFF;
    u1_s_altapp_4wd_wrn_out = (U1)ALTAPP_OUT_OFF;
    u1_s_altapp_4wd_rmt_out = (U1)ALTAPP_OUT_OFF;
}

/*===================================================================================================================================*/
/*  Routine Task                                                                                                                     */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
void vd_g_Altapp4wdRoutine(void)
{
    vd_s_Altapp4wdJudgeB4wd();
    vd_s_Altapp4wdJudgeB4wdlk();
}


/*===================================================================================================================================*/
/*  Judge Task B_4WD                                                                                                                 */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void vd_s_Altapp4wdJudgeB4wd(void)
{
#if(__ALTAPP_4WD_B_4WD_SUP__ == 1)
    U1 u1_t_sgnl;        /* 入力信号値             */
    U1 u1_t_sgnlsts;     /* 入力信号状態           */
    U1 u1_t_var;         /* 適用有無               */
    
    /* 入力値確定 */
    u1_t_sgnl = u1_ALTAPP_4WD_CANSGNL_B_4WD();
    u1_t_sgnlsts = u1_g_AltGetCanFrmstsSlctTime((SpfCcomDataHandlerType)ALTAPP_4WD_SGNL_ID_B_4WD,                   /* 途絶判定信号 */
                                                (U1)ALTAPP_4WD_B_4WD_PWRTYP,                                        /* 途絶判定電源 */
                                                (U2)ALTAPP_4WD_B_4WD_JDGTIME);                                      /* 途絶時間     */
    
    /* 出力値判定 */
    u1_t_var = u1_ALTAPP_4WD_B_4WD_SUP();
    u1_s_altapp_4wd_tt_out_4wd = u1_s_Altapp4wdJudgeB4wdTt(u1_t_sgnl, u1_t_sgnlsts, u1_t_var);
    u1_s_altapp_4wd_wrn_out = u1_s_Altapp4wdJudgeB4wdWrn(u1_t_sgnl, u1_t_sgnlsts, u1_t_var);
    u1_s_altapp_4wd_rmt_out = u1_s_Altapp4wdJudgeB4wdRmt(u1_t_sgnl, u1_t_sgnlsts, u1_t_var);
#else
    u1_s_altapp_4wd_tt_out_4wd = (U1)ALTAPP_OUT_OFF;
    u1_s_altapp_4wd_wrn_out = (U1)ALTAPP_OUT_OFF;
    u1_s_altapp_4wd_rmt_out = (U1)ALTAPP_OUT_OFF;
#endif
}

#if((__ALTAPP_4WD_B_4WD_SUP__ == 1) && (__ALTAPP_TT_DIFFLOCK_USE__ == 1))
/*===================================================================================================================================*/
/*  Judge Task B_4WD_TT                                                                                                              */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      u1_a_sgnl: 入力信号値                                                                                            */
/*                  u1_a_sgnlsts: 入力信号状態                                                                                       */
/*                  u1_a_var: バリエーション                                                                                         */
/*  Return:         u1_t_ret: 判定結果                                                                                               */
/*===================================================================================================================================*/
static U1 u1_s_Altapp4wdJudgeB4wdTt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var)
{
    U1 u1_t_inpt;        /* 入力確定値             */
    U1 u1_t_ret;         /* 戻り値                 */
    
    u1_t_inpt = u1_g_AltFixCanSgnlSlctTyp(u1_a_sgnlsts, u1_a_sgnl, (U1)ALTAPP_4WD_T_B_4WD_FAIL, (U1)ALTAPP_4WD_T_B_4WD_NORX, (U1)ALTAPP_4WD_T_B_4WD_FLTYP);
    u1_t_ret = u1_g_AltJdgCnd(u1_a_var,                                    /* バリエーション         */
                              u1_t_inpt,                                   /* 入力確定値             */
                              u1_ALTAPP_4WD_VI_CNDTBL,                     /* Vehicle Info テーブル  */
                              st_ALTAPP_4WD_CNDTBL_TT_4WD,                 /* 出力判定テーブル       */
                              (U1)ALTAPP_4WD_CNDTBL_SIZ_TT_4WD             /* 出力判定テーブルサイズ */
                             );
    return(u1_t_ret);
}
#endif

#if((__ALTAPP_4WD_B_4WD_SUP__ == 1) && (__ALTAPP_WRN_4WD_USE__ == 1))
/*===================================================================================================================================*/
/*  Judge Task B_4WD_WRN                                                                                                             */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      u1_a_sgnl: 入力信号値                                                                                            */
/*                  u1_a_sgnlsts: 入力信号状態                                                                                       */
/*                  u1_a_var: バリエーション                                                                                         */
/*  Return:         u1_t_ret: 判定結果                                                                                               */
/*===================================================================================================================================*/
static U1 u1_s_Altapp4wdJudgeB4wdWrn(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var)
{
    U1 u1_t_inpt;        /* 入力確定値             */
    U1 u1_t_ret;         /* 戻り値                 */
    
    u1_t_inpt = u1_g_AltFixCanSgnlSlctTyp(u1_a_sgnlsts, u1_a_sgnl, (U1)ALTAPP_4WD_W_B_4WD_FAIL, (U1)ALTAPP_4WD_W_B_4WD_NORX, (U1)ALTAPP_4WD_W_B_4WD_FLTYP);
    u1_t_ret = u1_g_AltJdgCnd(u1_a_var,                                    /* バリエーション         */
                              u1_t_inpt,                                   /* 入力確定値             */
                              u1_ALTAPP_4WD_VI_CNDTBL,                     /* Vehicle Info テーブル  */
                              st_ALTAPP_4WD_CNDTBL_WRN,                    /* 出力判定テーブル       */
                              (U1)ALTAPP_4WD_CNDTBL_SIZ_WRN                /* 出力判定テーブルサイズ */
                             );
    return(u1_t_ret);
}
#endif

#if((__ALTAPP_4WD_B_4WD_SUP__ == 1) && (__ALTAPP_RMT_FWW_USE__ == 1))
/*===================================================================================================================================*/
/*  Judge Task B_4WD_RMT                                                                                                             */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      u1_a_sgnl: 入力信号値                                                                                            */
/*                  u1_a_sgnlsts: 入力信号状態                                                                                       */
/*                  u1_a_var: バリエーション                                                                                         */
/*  Return:         u1_t_ret: 判定結果                                                                                               */
/*===================================================================================================================================*/
static U1 u1_s_Altapp4wdJudgeB4wdRmt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var)
{
    U1 u1_t_inpt;        /* 入力確定値             */
    U1 u1_t_ret;         /* 戻り値                 */
    
    u1_t_inpt = u1_g_AltFixCanSgnlSlctTyp(u1_a_sgnlsts, u1_a_sgnl, (U1)ALTAPP_4WD_R_B_4WD_FAIL, (U1)ALTAPP_4WD_R_B_4WD_NORX, (U1)ALTAPP_4WD_R_B_4WD_FLTYP);
    u1_t_ret = u1_g_AltJdgCnd(u1_a_var,                                    /* バリエーション         */
                              u1_t_inpt,                                   /* 入力確定値             */
                              u1_ALTAPP_4WD_VI_CNDTBL,                     /* Vehicle Info テーブル  */
                              st_ALTAPP_4WD_CNDTBL_RMT,                    /* 出力判定テーブル       */
                              (U1)ALTAPP_4WD_CNDTBL_SIZ_RMT                /* 出力判定テーブルサイズ */
                             );
    return(u1_t_ret);
}
#endif

/*===================================================================================================================================*/
/*  Judge Task B_4WDLK                                                                                                               */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      -                                                                                                                */
/*  Return:         -                                                                                                                */
/*===================================================================================================================================*/
static void vd_s_Altapp4wdJudgeB4wdlk(void)
{
#if(__ALTAPP_4WD_B_4WDLK_SUP__ == 1)
    U1 u1_t_sgnl;        /* 入力信号値             */
    U1 u1_t_sgnlsts;     /* 入力信号状態           */
    U1 u1_t_var;         /* 適用有無               */
    
    /* 入力値確定 */
    u1_t_sgnl = u1_ALTAPP_4WD_CANSGNL_B_4WDLK();
    u1_t_sgnlsts = u1_g_AltGetCanFrmstsSlctTime((SpfCcomDataHandlerType)ALTAPP_4WD_SGNL_ID_B_4WDLK,                    /* 途絶判定信号 */
                                                (U1)ALTAPP_4WD_B_4WDLK_PWRTYP,                                         /* 途絶判定電源 */
                                                (U2)ALTAPP_4WD_B_4WDLK_JDGTIME);                                       /* 途絶時間     */
    
    /* 出力値判定 */
    u1_t_var = u1_ALTAPP_4WD_B_4WDLK_SUP();
    u1_s_altapp_4wd_tt_out_4wdlk = u1_s_Altapp4wdJudgeB4wdlkTt(u1_t_sgnl, u1_t_sgnlsts, u1_t_var);
#else
    u1_s_altapp_4wd_tt_out_4wdlk = (U1)ALTAPP_OUT_OFF;
#endif
}

#if((__ALTAPP_4WD_B_4WDLK_SUP__ == 1) && (__ALTAPP_TT_DIFFLOCK_USE__ == 1))
/*===================================================================================================================================*/
/*  Judge Task B_4WDLK_TT                                                                                                            */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      u1_a_sgnl: 入力信号値                                                                                            */
/*                  u1_a_sgnlsts: 入力信号状態                                                                                       */
/*                  u1_a_var: バリエーション                                                                                         */
/*  Return:         u1_t_ret: 判定結果                                                                                               */
/*===================================================================================================================================*/
static U1 u1_s_Altapp4wdJudgeB4wdlkTt(U1 u1_a_sgnl, U1 u1_a_sgnlsts, U1 u1_a_var)
{
    U1 u1_t_inpt;        /* 入力確定値             */
    U1 u1_t_ret;         /* 戻り値                 */
    
    u1_t_inpt = u1_g_AltFixCanSgnlSlctTyp(u1_a_sgnlsts, u1_a_sgnl, (U1)ALTAPP_4WD_T_B_4WDLK_FAIL, (U1)ALTAPP_4WD_T_B_4WDLK_NORX, (U1)ALTAPP_4WD_T_B_4WDLK_FLTYP);
    u1_t_ret = u1_g_AltJdgCnd(u1_a_var,                               /* バリエーション         */
                              u1_t_inpt,                              /* 入力確定値             */
                              u1_ALTAPP_4WD_VI_CNDTBL,                /* Vehicle Info テーブル  */
                              st_ALTAPP_4WD_CNDTBL_TT_4WDLK,          /* 出力判定テーブル       */
                              (U1)ALTAPP_4WD_CNDTBL_SIZ_TT_4WDLK      /* 出力判定テーブルサイズ */
                             );
    return(u1_t_ret);
}
#endif

/*===================================================================================================================================*/
/*  Output Status Telltale                                                                                                           */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdOutTt4wd(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_TT_DIFFLOCK_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_TT_DIFFLOCK_SUP();
    
    u1_t_ret = u1_g_AltJdgOutSts(u1_t_var, u1_s_altapp_4wd_tt_out_4wd); /* 機能有りなら第2引数を取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Telltale                                                                                                           */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdOutTt(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_TT_DIFFLOCK_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_TT_DIFFLOCK_SUP();
    
    u1_t_ret = u1_g_AltJdgOutSts(u1_t_var, u1_s_altapp_4wd_tt_out_4wdlk); /* 機能有りなら第2引数を取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Warning No.10 (4WD Test Mode)                                                                                      */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdTstOutWrn(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_WRN_4WD_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_WRN_4WD_SUP();
    
    u1_t_ret = u1_g_AltJdgOut(u1_t_var, u1_s_altapp_4wd_wrn_out, (U1)ALTAPP_4WD_TST_ON); /* 機能有り&第3引数と一致ならALTAPP_OUT_ONを取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Warning No.430 (4WD System Malfunction)                                                                            */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdSysOutWrn(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_WRN_4WD_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_WRN_4WD_SUP();
    
    u1_t_ret = u1_g_AltJdgOut(u1_t_var, u1_s_altapp_4wd_wrn_out, (U1)ALTAPP_4WD_SYS_ON); /* 機能有り&第3引数と一致ならALTAPP_OUT_ONを取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Warning No.645 (4WD Cancel)                                                                                        */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdCnclOutWrn(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_WRN_4WD_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_WRN_4WD_SUP();
    
    u1_t_ret = u1_g_AltJdgOut(u1_t_var, u1_s_altapp_4wd_wrn_out, (U1)ALTAPP_4WD_CNCL_ON); /* 機能有り&第3引数と一致ならALTAPP_OUT_ONを取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Warning No.646 (4WD Over Heat)                                                                                     */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdOvtOutWrn(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_WRN_4WD_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_WRN_4WD_SUP();
    
    u1_t_ret = u1_g_AltJdgOut(u1_t_var, u1_s_altapp_4wd_wrn_out, (U1)ALTAPP_4WD_OVT_ON); /* 機能有り&第3引数と一致ならALTAPP_OUT_ONを取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*===================================================================================================================================*/
/*  Output Status Remote                                                                                                             */
/*                                                                                                                                   */
/* --------------------------------------------------------------------------------------------------------------------------------- */
/*  Arguments:      U1 u1_a_dummy                                                                                                    */
/*  Return:         出力判定結果                                                                                                     */
/*===================================================================================================================================*/
U1 u1_g_Altapp4wdOutRmt(U1 u1_a_dummy)
{
    U1 u1_t_ret;         /* 戻り値                 */
#if(__ALTAPP_RMT_FWW_USE__ == 1)
    U1 u1_t_var;         /* 機能有無               */
    
    u1_t_var = u1_g_ALTAPP_RMT_FWW_SUP();
    
    u1_t_ret = u1_g_AltJdgOutSts(u1_t_var, u1_s_altapp_4wd_rmt_out); /* 機能有りなら第2引数を取得 */
#else
    u1_t_ret = (U1)ALTAPP_OUT_OFF;
#endif
    return(u1_t_ret);
}

/*-----------------------------------------------------------------------------------------------------------------------------------*/
/*  Function Sw                                                                                                                      */
/*-----------------------------------------------------------------------------------------------------------------------------------*/
#endif
/*-----------------------------------------------------------------------------------------------------------------------------------*/

/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Change History                                                                                                                   */
/*                                                                                                                                   */
/*===================================================================================================================================*/
/*                                                                                                                                   */
/*  Version         Date        Author  Change Description                                                                           */
/* ---------------  ----------  ------  -------------------------------------------------------------------------------------------  */
/*  0.0.0           2017.03.06  TaT     新規作成                                                                                     */
/*  0.0.0-180B-1    2017.05.09  YF      コンパイルSWによるRAM化け対策追加                                                            */
/*                                      CAN,直線入力 コンパイルSW切り分け追加                                                        */
/*  0.1.0           2017.07.25  HO      Alert共通化対応                                                                              */
/*  0.2.0           2017.08.09  HT      リモート共通仕様対応                                                                         */
/*  0.2.1           2017.09.18  TK      Include順Warning対応                                                                         */
/*  0.3.1           2017.11.09  SS      150B 1A対応                                                                                  */
/*                                        4WD/AWD表示文言切替用IF追加(経由のみ)                                                      */
/*  0.4.0           2017.11.23  SS      150B 1A対応                                                                                  */
/*                                        リモート共通仕様対応(altapp_rmt廃止による変更)                                             */
/*                                                                                                                                   */
/*  * TaT = Takeshi Tomomura                                                                                                         */
/*  * YF = Yoshifumi Fujita, Denso Techno                                                                                            */
/*  * HO = Hiroyuki Orio                                                                                                             */
/*  * HT = Hiroshi Teraoka                                                                                                           */
/*  * TK = Tatsushi Kojima                                                                                                           */
/*  * SS = Shinya Shimokawa                                                                                                          */
/*                                                                                                                                   */
/*===================================================================================================================================*/
